{
    "not-found": {
        "text": "Page not found",
        "button-to-home": "Go to main page",
        "button-back": "Back to previous page"
    },
    "header": {
        "main": "MAIN",
        "about": "ABOUT ME",
        "contacts": "CONTACTS",
        "projects": "PROJECTS",
        "skills": "SKILLS"
    },
    "main": {
        "h-1": "Hello!",
        "h-2": "My name is Artem, I'm a frontend developer from St. Petersburg, working with React and learning UX/UI design"
    },
    "projects": {
        "repository": "GitHub repository",
        "site": "Live page",
        "aeroflex": {
            "name": "Technical insulation calculators",
            "description1": "The work was done for a client.",
            "description2": "The project includes the development of new calculators, as well as changing the logic of the calculators installed earlier.",
            "description3": "During the project it was proposed to make changes in the design, making the calculator more convenient, which the client agreed to and was satisfied with the work done.",
            "description4": "Legacy code support was required, which I successfully coped with, completed the project and successfully implemented it into the client's CMS system."
        },
        "vzkg": {
            "name": "Visual cladding material constructor",
            "description1": "The work was carried out to the client's order.",
            "description2": "Developed a standalone module that could be embedded into the client's CMS in the future.",
            "description3": "There were no restrictions, but it was decided to use jQuery, as on the client's site. The logic of work is based on the use of different layers and their positioning on a fixed image.",
            "description4": "The work was done in a style that would fit as harmoniously as possible on the client's website. The client was completely satisfied with the work."
        },
        "flags": {
            "name": "Directory of basic country information",
            "description1": "A learning project where I applied React in conjunction with Typescript.",
            "description2": "I also used React-Router for navigation, React-Redux for state storage and custom React hooks to change the theme in the application.",
            "description3": "For storing and retrieving information in the application I used third-party API and Axios.",
            "description4": "By the way, for styling components in this project I used Styled-Components for the sake of experimentation, although I prefer SCSS."
        },
        "userFinder": {
            "name": "Search and information about any GitHub user",
            "description1": "A small training project where I used React in conjunction with Typescript.",
            "description2": "It allows you to find any GitHub user by their nickname and get useful information about them.",
            "description3": "I used the GitHub API to get information about GitHub users.",
            "description4": "With this project I started my introduction to Typescript and it was an interesting experience."
        },
        "library": {
            "name": "A simple library",
            "description1": "A small training project, the point of which is to transparently use and understand React-Redux and vanilla Redux.",
            "description2": "It represents the basic workflow of a small library application.",
            "description3": "Allows adding new books and retrieving random books stored on my API server for another project or stored locally in the project. ",
            "description4": "Books can be marked as favorites, sorted and un-favorites can be hidden. Live search on the list of books is present."
        },
        "reviews": {
            "name": "Review aggregator",
            "description1": "Big project, written as a final paper for an internship at iTransition.",
            "description2": "It is an app-aggregator of reviews of films, books and anything artistic. Allows you to log in via Google or GitHub, write reviews, give likes, see your likes count, comment on reviews or search for a review.",
            "description3": "The React app calls my Node.js API and fetches data from a deployed PostgreSQL database. The images are stored in a cloud service Cloudinary.",
            "description4": "The app has an option to change the theme and interface language."
        },
        "calculator": {
            "name": "Calculator",
            "description1": "A simple React application. ",
            "description2": "There is a possibility to choose several design themes.",
            "description3": "The application is fully adapted for different devices.",
            "description4": "All characters work when entered from the keyboard."
        },
        "todos": {
            "name": "To-do list",
            "description1": "There's no getting around the classic To-Do List :)",
            "description2": "To use it you need to register with any email - there will be no verification.",
            "description3": "The data is stored on Google Firebase service.",
            "description4": "You can create to-do's and add them to the list by adding any date from your calendar, mark them as done, delete them or sort them. Overdue cases will be marked in red for your convenience."
        },
        "geolocation": {
            "name": "Geolocation detection by IP",
            "description1": "A small application that I started to learn the basics of JavaScript while creating.",
            "description2": "Using a third-party API and information provided by the browser, we can get our approximate location.",
            "description3": "You can also get the location of any IP you are interested in.",
            "description4": ""
        },
        "balls": {
            "name": "Landing \"Balloons\"",
            "description1": "The time of my learning CSS and CSS preprocessors.",
            "description2": "The project is written without JavaScript.",
            "description3": "All attention was paid to CSS animation and adaptive, thanks to which the landing looks great on any device.",
            "description4": ""
        },
        "games": {
            "name": "Landing \"Gaming Club\"",
            "description1": "One of my first lendings.",
            "description2": "Like Ballons project, it was written without JavaScript.",
            "description3": "All attention was paid to learning Flexbox and Grid - the most popular methods for creating flexible and adaptive layouts in web development.",
            "description4": ""
        }
    },
    "skills": {
        "cards-button": "CARDS",
        "list-button": "LIST",
        "separator1": "FUNDAMENTAL",
        "separator2": "ADDITIONAL",
        "separator3": "SERVER AND DATA",
        "separator4": "INTERFACE STYLING",
        "separator5": "DEVELOPMENT TOOLS",
        "cards": {
            "html": {
                "name": "HTML",
                "description": "A markup language used to create the structure of web pages. It defines content elements and their hierarchy on a page using tags."
            },
            "css": {
                "name": "CSS",
                "description": "A style language that defines the appearance and formatting of HTML elements. CSS allows you to control the colors, fonts, sizes, and positioning of elements on a web page."
            },
            "js": {
                "name": "JavaScript",
                "description": "A programming language that is used to add interactivity to web pages. It is used to create dynamic content, animations, event handling, and more."
            },
            "git": {
                "name": "Git",
                "description": "A version control system used to manage changes to a project's source code. It allows developers to track changes, create development branches, merge changes, and manage project history."
            },
            "ts": {
                "name": "TypeScript",
                "description": "An extension of the JavaScript language that adds static typing and other features such as interfaces, enumerations, and generics. TypeScript helps improve the development process by reducing bugs and improving IDE support."
            },
            "react": {
                "name": "React",
                "description": "JavaScript library for creating user interfaces. It is used to develop interactive web applications, allowing you to create components that automatically update when data changes."
            },
            "redux": {
                "name": "Redux",
                "description": "A state management library for JavaScript applications, often used in conjunction with React. Redux provides unidirectional data flow and a single repository for application state, making state management predictable and easy to debug."
            },
            "router": {
                "name": "React-Router",
                "description": "A routing library for React applications. React Router allows you to create single-page applications with dynamic URLs, enabling URL-based navigation between different components."
            },
            "rest": {
                "name": "RESTful API",
                "description": "An architectural style for designing networked applications that utilizes the HTTP protocol to manipulate data. The RESTful API provides a standardized set of operations (e.g., GET, POST, PUT, DELETE) to manage resources on the server."
            },
            "api": {
                "name": "API",
                "description": "A set of definitions and protocols that is used to communicate between different components of software. An API defines how different parts of a program can communicate with each other."
            },
            "npm": {
                "name": "NPM",
                "description": "A package manager for JavaScript used to install, manage, and publish code packages. npm allows developers to easily find and install project dependencies and share their own packages with the community."
            },
            "docker": {
                "name": "Docker",
                "description": "A platform for developing, delivering, and running applications in containers. Docker containers provide an isolated environment for applications and their dependencies, making applications portable and easily scalable."
            },
            "jquery": {
                "name": "jQuery",
                "description": "A JavaScript library that facilitates HTML element manipulation, event handling, animation, and server-side interaction. jQuery makes it easy to write cross-browser JavaScript code and accelerates web application development."
            },
            "node": {
                "name": "Node.js",
                "description": "A server-side JavaScript runtime environment for building high-performance and scalable networked applications. Node.js is based on Google Chrome's V8 engine and provides asynchronous and event-driven programming."
            },
            "express": {
                "name": "Express",
                "description": "A minimalistic and flexible web framework for Node.js that makes it easy to build web applications and APIs. Express provides a set of methods and utilities for handling HTTP requests, routing, and session management."
            },
            "passport": {
                "name": "Passport.js",
                "description": "An authentication library for Node.js that provides a simple and flexible mechanism for authentication and authorization in web applications. Supports various authentication strategies such as local authentication, OAuth, and OpenID."
            },
            "mongo": {
                "name": "MongoDB",
                "description": "A document-oriented NoSQL database used to store and manage data in JSON document format. MongoDB offers flexible data schema, scalability, and high performance when dealing with large amounts of data."
            },
            "postgresql": {
                "name": "PostgreSQL",
                "description": "An open source relational database that supports advanced SQL features and provides reliable data storage and management. PostgreSQL offers many features including transactional support, geodata, and full-text search."
            },
            "firebase": {
                "name": "Firebase",
                "description": "An application development platform from Google that provides a set of tools for building high-quality web and mobile applications. Firebase includes services such as real-time database, authentication, hosting, cloud features, and more."
            },
            "cloud": {
                "name": "Google Cloud",
                "description": "A cloud platform provided by Google that offers various cloud services including computing resources, data storage, databases, analytics, machine learning, and more."
            },
            "cloudinary": {
                "name": "Cloudinary",
                "description": "A cloud-based service for managing media content such as images, video, and audio. Cloudinary provides APIs for uploading, processing, storing and delivering media content in web applications."
            },
            "scss": {
                "name": "SCSS / SASS",
                "description": "A CSS preprocessor that extends the functionality of regular CSS by adding variables, nested rules, mixins, and other features to simplify and improve the styling process."
            },
            "less": {
                "name": "LESS",
                "description": "Another CSS preprocessor, similar to SCSS/SASS, that adds additional features to standard CSS, such as variables, mixins, nested styles, and more."
            },
            "material": {
                "name": "Material UI",
                "description": "A library of user interface components based on Google's Material Design system. Material UI provides ready-made components for developing modern and stylish web applications using React."
            },
            "motion": {
                "name": "Framer Motion",
                "description": "An animation library for React that provides a simple and declarative way to create animations in web applications.  Allows you to create different types of animations such as transitions between components, animated components and more."
            },
            "bootstrap": {
                "name": "Bootstrap",
                "description": "A framework for web and mobile app development that provides a set of ready-made components and CSS styles. Bootstrap helps you create adaptive and stylish interfaces with minimal effort."
            },
            "tailwind": {
                "name": "Tailwind CSS",
                "description": "A CSS framework that provides a set of ready-made classes for styling web pages. Tailwind CSS takes a utility-first approach, allowing you to quickly and flexibly create custom styles using CSS classes."
            },
            "styled": {
                "name": "Styled-Components",
                "description": "A library for styling components in React applications using CSS as JavaScript. Styled-Components allows you to create components with bound styles, making it easy to create and maintain styled components."
            },
            "vscode": {
                "name": "VS Code",
                "description": "Microsoft's integrated development environment (IDE) for writing code. VS Code has many extensions, supports a variety of programming languages, and provides extensive customization options for easy and efficient development."
            },
            "devtools": {
                "name": "Chrome DevTools",
                "description": "Web browser developer tools, that provide developers with the ability to debug, profile, and analyze web applications. Dev Tools include tools for inspecting HTML, CSS, JavaScript, network requests, and more."
            },
            "webpack": {
                "name": "Webpack",
                "description": "A modular packer for JavaScript applications that allows you to combine and manage project dependencies. Webpack allows you to create static assets such as JavaScript, CSS and images and optimize them for production."
            },
            "vite": {
                "name": "Vite",
                "description": "A fast web application development tool that utilizes modern JavaScript features such as ESM (ECMAScript Modules) and HMR (Hot Module Replacement). Vite allows you to develop web applications with speed and efficiency."
            },
            "parcel": {
                "name": "Parcel",
                "description": "A tool for bundling and optimizing JavaScript and CSS files. Parcel provides a simple and declarative way to build web applications using JavaScript and CSS."
            },
            "babel": {
                "name": "Babel",
                "description": "A tool for translating JavaScript code from a modern standard to an older standard that is compatible with a wider range of browsers and JavaScript runtime environments. Allows you to take advantage of new JavaScript language features without worrying about compatibility."
            },
            "postman": {
                "name": "Postman",
                "description": "An API testing and debugging tool that provides a user-friendly interface for sending HTTP requests and validating responses. Postman allows you to create and automate API tests and share collections of requests with other developers."
            },
            "figma": {
                "name": "Figma",
                "description": "A graphical editor and interface design environment that allows designers to create mockups, prototypes, and collaborate on design projects in real time. Figma provides extensive capabilities for creating modern and interactive designs."
            },
            "photoshop": {
                "name": "Adobe Photoshop",
                "description": "A graphic editor developed by Adobe that is widely used to create and edit images. Photoshop provides many tools for working with digital images, including retouching, applying effects, and creating compositions."
            }
        }
    },
    "contacts": {
        "telegram": "Telegram",
        "github": "GitHub",
        "mail": "yakovenko.art1@gmail.com",
        "linkedin": "LinkedIn",
        "cv": "Download resume PDF"
    },
    "about": {
        "card1": "My name is Artem Yakovenko, I'm 26 years old and I'm a frontend developer from St. Petersburg, working with React and learning UX/UI design.",
        "card2": "My professional journey began in the service industry, where I worked as a bartender in well-known establishments in my city, such as TOKYO-CITY and BAHROMA. The bar industry taught me about responsiveness, effective communication and time management, which has been a valuable experience in my career. Thanks to my diligence and love for my work, I quickly became a senior bartender and later opened a new restaurant VillaVerde with my colleagues.",
        "card3": "In 2022, I decided it was time to move on. The best decision was to change direction and immerse myself in the world of IT. I have always been attracted by the ability to instantly visualize the results of my work, which is a perfect match for frontend development and design. To master a new profession I took a lot of specialized courses and actively engaged in self-education. It is important for me to get only useful information and practice it myself, so I avoided large courses with streaming training and minimal attention to students.",
        "card4": "In the same year I left St. Petersburg and am now in Tashkent. Here, in 2023, I had an internship at Itransition, a large IT company, where I gained valuable experience. Then I worked on several projects with TiverGroup. At the moment, I am looking for new challenges and opportunities for growth. I am looking for a job where I can apply my experience, learn new development tools and bring maximum value to the team.",
        "card5": "In my free time I enjoy running, playing tennis, traveling by bike and enjoying mountain hiking. Another passion of mine is cooking. I find that having a variety of hobbies helps me find inspiration and maintain balance in my life.",
        "card1H1": "Hello!"
    }
}
