{
    "not-found": {
        "text": "Страница не найдена",
        "button-to-home": "Перейти на главную",
        "button-back": "Вернуться на предыдущую страницу"
    },
    "header": {
        "main": "ГЛАВНАЯ",
        "about": "ОБО МНЕ",
        "contacts": "КОНТАКТЫ",
        "projects": "ПРОЕКТЫ",
        "skills": "НАВЫКИ"
    },
    "main": {
        "h-1": "Привет!",
        "h-2": "Меня зовут Артем, Я fullstack  разработчик из Санкт-Петербурга с уклоном во frontend и UX/UI дизайн"
    },
    "projects": {
        "repository": "GitHub репозиторий",
        "site": "Ссылка на сайт",
        "aeroflex": {
            "name": "Калькуляторы технической изоляции",
            "description1": "Работа выполнена для клиента.",
            "description2": "Проект включает в себя разработку новых калькуляторов, а также изменение логики в работе калькуляторов, установленных ранее.",
            "description3": "В ходе проекта было предложено внести изменения в дизайн, сделав калькулятор более удобным, на что клиент согласился и остался доволен выполненной работой.",
            "description4": "Требовалась поддержка легаси кода, с чем я удачно справился, выполнил проект и удачно внедрил его в CMS клиента."
        },
        "vzkg": {
            "name": "Визуальный конфигуратор облицовочного материала",
            "description1": "Работа выполнена по заказу клиента.",
            "description2": "Разработал автономный модуль, который в дальнейшем можно было бы встроить в CMS клиента.",
            "description3": "Ограничений не было, но было решено использовать jQuery, как и на сайте клиента. Логика работы основана на использовании различных слоёв и их позиционировании на фиксированном изображении.",
            "description4": "Работа была выполнена в стиле, который бы максимально гармонично вписался на сайт заказчика. Клиент остался полностью доволен работой."
        },
        "flags": {
            "name": "Справочник основной информации о странах",
            "description1": "Учебный проект, в котором я применил React в связке с Typescript.",
            "description2": "Использованы так же React-Router для навигации, React-Redux для хранения состояния и кастомные хуки React для изменения темы в приложении.",
            "description3": "Для хранения и получения информации в приложении использовал стороннее API и Axios.",
            "description4": "Кстати, для стилизации компонентов в этом проекте я использовал Styled-Components ради эксперимента, хотя предпочитаю SCSS."
        },
        "userFinder": {
            "name": "Поиск и информация о любом пользователе GitHub",
            "description1": "Небольшой учебный проект, в котором я применил React в связке с Typescript.",
            "description2": "Позволяет найти любого пользователя GitHub по никнейму и получить полезную информацию о нём.",
            "description3": "Для получения информации о пользователях GitHub я использовал GitHub API.",
            "description4": "С этим проектом я начал своё знакомство с Typescript и это был интересный опыт."
        },
        "library": {
            "name": "Структура для библиотеки",
            "description1": "Небольшой тренировочный проект, суть которого в прозрачном использовании и понимании React-Redux и ванильного Redux.",
            "description2": "Представляет собой основную схему работы небольшого приложения-библиотеки.",
            "description3": "Позволяет добавлять новые книги и получать случайные книги, хранящиеся на сервере моего API для другого проекта или хранящиеся локально в проекте. ",
            "description4": "Книги можно помечать как любимые, сортировать и скрывать нелюбимые. Присутствует живой поиск по списку книг."
        },
        "reviews": {
            "name": "Агрегатор рецензий",
            "description1": "Большой проект, написан как итоговая работа на стажировке в iTransition.",
            "description2": "Представляет собой приложение-агрегатор отзывов на фильмы, книги и что-либо художественное. Позволят авторизоваться через Google или GitHub, писать отзывы, ставить лайки, видеть счётчик ваших лайков, оставлять комментарии к обзорам или искать нужный обзор.",
            "description3": "React-приложение обращается к моему API на Node.js и получает данные из развёрнутой базы данных PostgreSQL. Изображения хранятся в облачном сервисе Cloudinary.",
            "description4": "В приложении есть возможность сменить тему и язык интерфейса."
        },
        "calculator": {
            "name": "Калькулятор",
            "description1": "Простенькое приложение на React.",
            "description2": "Есть возможность выбрать несколько тем оформления.",
            "description3": "Приложение полностью адаптировано под различные устройства.",
            "description4": "Все знаки работают при вводе с клавиатуры."
        },
        "todos": {
            "name": "Список дел",
            "description1": "Не обойтись без классического списка дел :)",
            "description2": "Для использования необходимо зарегистрироваться с помощью любого email - проверки не будет.",
            "description3": "Данные хранятся на Google сервисе Firebase.",
            "description4": "Вы можете создавать дела и вносить их в список, добавляя к ним любую дату из календаря, помечать как выполненные, удалять или сортировать. Дела с просроченной датой будут помечены красным для удобства."
        },
        "geolocation": {
            "name": "Определение геолокации по IP",
            "description1": "Небольшое приложение, при создании которого я начинал постигать азы JavaScript.",
            "description2": "Используя стороннее API и информацию, предоставляемую браузером, мы можем получить наше приблизительное местоположение.",
            "description3": "Так же можно получить местоположение любого интересующего вас IP.",
            "description4": ""
        },
        "balls": {
            "name": "Лэндинг \"Воздушные шары\"",
            "description1": "Времена изучения мной CSS и CSS препроцессоров.",
            "description2": "Проект написан без использования JavaScript. ",
            "description3": "Всё внимание было уделено CSS анимации и адаптиву, благодаря чему лэндинг отлично смотрится на любом устройстве.",
            "description4": ""
        },
        "games": {
            "name": "Лэндинг \"Игровой клуб\"",
            "description1": "Один из первых моих лендингов. ",
            "description2": "Как и в проекте Ballons, написан без использования JavaScript. ",
            "description3": "Всё внимание было уделено изучению Flexbox и Grid -   самым популярным методам для создания гибких и адаптивных макетов в веб-разработке.",
            "description4": ""
        }
    },
    "skills": {
        "separator1": "ОСНОВНЫЕ",
        "separator2": "ДОПОЛНИТЕЛЬНЫЕ",
        "separator3": "СЕРВЕР И ДАННЫЕ"
    }
}
