{
    "not-found": {
        "text": "Страница не найдена",
        "button-to-home": "Перейти на главную",
        "button-back": "Вернуться на предыдущую страницу"
    },
    "header": {
        "main": "ГЛАВНАЯ",
        "about": "ОБО МНЕ",
        "contacts": "КОНТАКТЫ",
        "projects": "ПРОЕКТЫ",
        "skills": "НАВЫКИ"
    },
    "main": {
        "h-1": "Привет!",
        "h-2": "Меня зовут Артем, Я fullstack  разработчик из Санкт-Петербурга с уклоном во frontend и UX/UI дизайн"
    },
    "projects": {
        "repository": "GitHub репозиторий",
        "site": "Ссылка на сайт",
        "aeroflex": {
            "name": "Калькуляторы технической изоляции",
            "description1": "Работа выполнена для клиента.",
            "description2": "Проект включает в себя разработку новых калькуляторов, а также изменение логики в работе калькуляторов, установленных ранее.",
            "description3": "В ходе проекта было предложено внести изменения в дизайн, сделав калькулятор более удобным, на что клиент согласился и остался доволен выполненной работой.",
            "description4": "Требовалась поддержка легаси кода, с чем я удачно справился, выполнил проект и удачно внедрил его в CMS клиента."
        },
        "vzkg": {
            "name": "Визуальный конфигуратор облицовочного материала",
            "description1": "Работа выполнена по заказу клиента.",
            "description2": "Разработал автономный модуль, который в дальнейшем можно было бы встроить в CMS клиента.",
            "description3": "Ограничений не было, но было решено использовать jQuery, как и на сайте клиента. Логика работы основана на использовании различных слоёв и их позиционировании на фиксированном изображении.",
            "description4": "Работа была выполнена в стиле, который бы максимально гармонично вписался на сайт заказчика. Клиент остался полностью доволен работой."
        },
        "flags": {
            "name": "Справочник основной информации о странах",
            "description1": "Учебный проект, в котором я применил React в связке с Typescript.",
            "description2": "Использованы так же React-Router для навигации, React-Redux для хранения состояния и кастомные хуки React для изменения темы в приложении.",
            "description3": "Для хранения и получения информации в приложении использовал стороннее API и Axios.",
            "description4": "Кстати, для стилизации компонентов в этом проекте я использовал Styled-Components ради эксперимента, хотя предпочитаю SCSS."
        },
        "userFinder": {
            "name": "Поиск и информация о любом пользователе GitHub",
            "description1": "Небольшой учебный проект, в котором я применил React в связке с Typescript.",
            "description2": "Позволяет найти любого пользователя GitHub по никнейму и получить полезную информацию о нём.",
            "description3": "Для получения информации о пользователях GitHub я использовал GitHub API.",
            "description4": "С этим проектом я начал своё знакомство с Typescript и это был интересный опыт."
        },
        "library": {
            "name": "Структура для библиотеки",
            "description1": "Небольшой тренировочный проект, суть которого в прозрачном использовании и понимании React-Redux и ванильного Redux.",
            "description2": "Представляет собой основную схему работы небольшого приложения-библиотеки.",
            "description3": "Позволяет добавлять новые книги и получать случайные книги, хранящиеся на сервере моего API для другого проекта или хранящиеся локально в проекте. ",
            "description4": "Книги можно помечать как любимые, сортировать и скрывать нелюбимые. Присутствует живой поиск по списку книг."
        },
        "reviews": {
            "name": "Агрегатор рецензий",
            "description1": "Большой проект, написан как итоговая работа на стажировке в iTransition.",
            "description2": "Представляет собой приложение-агрегатор отзывов на фильмы, книги и что-либо художественное. Позволят авторизоваться через Google или GitHub, писать отзывы, ставить лайки, видеть счётчик ваших лайков, оставлять комментарии к обзорам или искать нужный обзор.",
            "description3": "React-приложение обращается к моему API на Node.js и получает данные из развёрнутой базы данных PostgreSQL. Изображения хранятся в облачном сервисе Cloudinary.",
            "description4": "В приложении есть возможность сменить тему и язык интерфейса."
        },
        "calculator": {
            "name": "Калькулятор",
            "description1": "Простенькое приложение на React.",
            "description2": "Есть возможность выбрать несколько тем оформления.",
            "description3": "Приложение полностью адаптировано под различные устройства.",
            "description4": "Все знаки работают при вводе с клавиатуры."
        },
        "todos": {
            "name": "Список дел",
            "description1": "Не обойтись без классического списка дел :)",
            "description2": "Для использования необходимо зарегистрироваться с помощью любого email - проверки не будет.",
            "description3": "Данные хранятся на Google сервисе Firebase.",
            "description4": "Вы можете создавать дела и вносить их в список, добавляя к ним любую дату из календаря, помечать как выполненные, удалять или сортировать. Дела с просроченной датой будут помечены красным для удобства."
        },
        "geolocation": {
            "name": "Определение геолокации по IP",
            "description1": "Небольшое приложение, при создании которого я начинал постигать азы JavaScript.",
            "description2": "Используя стороннее API и информацию, предоставляемую браузером, мы можем получить наше приблизительное местоположение.",
            "description3": "Так же можно получить местоположение любого интересующего вас IP.",
            "description4": ""
        },
        "balls": {
            "name": "Лэндинг \"Воздушные шары\"",
            "description1": "Времена изучения мной CSS и CSS препроцессоров.",
            "description2": "Проект написан без использования JavaScript. ",
            "description3": "Всё внимание было уделено CSS анимации и адаптиву, благодаря чему лэндинг отлично смотрится на любом устройстве.",
            "description4": ""
        },
        "games": {
            "name": "Лэндинг \"Игровой клуб\"",
            "description1": "Один из первых моих лендингов. ",
            "description2": "Как и в проекте Ballons, написан без использования JavaScript. ",
            "description3": "Всё внимание было уделено изучению Flexbox и Grid -  самым популярным методам для создания гибких и адаптивных макетов в веб-разработке.",
            "description4": ""
        }
    },
    "skills": {
        "cards-button": "КАРТОЧКИ",
        "list-button": "СПИСОК",
        "separator1": "ОСНОВНЫЕ",
        "separator2": "ДОПОЛНИТЕЛЬНЫЕ",
        "separator3": "СЕРВЕР И ДАННЫЕ",
        "separator4": "СТИЛИЗАЦИЯ ИНТЕРФЕЙСОВ",
        "separator5": "ИНСТРУМЕНТЫ РАЗРАБОТКИ",
        "cards": {
            "html": {
                "name": "HTML",
                "description": "Язык разметки, используемый для создания структуры веб-страниц. Он определяет элементы содержимого и их иерархию на странице с помощью тегов."
            },
            "css": {
                "name": "CSS",
                "description": "Язык стилей, который определяет внешний вид и форматирование элементов HTML. CSS позволяет управлять цветами, шрифтами, размерами и расположением элементов на веб-странице."
            },
            "js": {
                "name": "JavaScript",
                "description": "Язык программирования, который применяется для добавления интерактивности на веб-страницы. Он используется для создания динамического контента, анимаций, обработки событий и многого другого."
            },
            "git": {
                "name": "Git",
                "description": "Система контроля версий, используемая для управления изменениями в исходном коде проекта. Она позволяет разработчикам отслеживать изменения, создавать ветви разработки, объединять изменения и управлять историей проекта."
            },
            "ts": {
                "name": "TypeScript",
                "description": "Расширение языка JavaScript, добавляющее статическую типизацию и другие возможности, такие как интерфейсы, перечисления и дженерики. TypeScript помогает улучшить процесс разработки, уменьшая количество ошибок и улучшая поддержку IDE."
            },
            "react": {
                "name": "React",
                "description": "JavaScript библиотека для создания пользовательских интерфейсов. Она используется для разработки интерактивных веб-приложений, позволяя создавать компоненты, которые автоматически обновляются при изменении данных."
            },
            "redux": {
                "name": "Redux",
                "description": "Библиотека управления состоянием для JavaScript-приложений, часто используемая вместе с React. Redux обеспечивает однонаправленный поток данных и единое хранилище состояния приложения, что делает управление состоянием предсказуемым и легким в отладке."
            },
            "router": {
                "name": "React-Router",
                "description": "Библиотека маршрутизации для React приложений. React Router позволяет создавать одностраничные приложения с динамическими URL, что обеспечивает навигацию между различными компонентами на основе URL."
            },
            "rest": {
                "name": "REST API",
                "description": " Архитектурный стиль для проектирования сетевых приложений, который использует HTTP протокол для работы с данными. RESTful API предоставляет стандартизированный набор операций (например, GET, POST, PUT, DELETE) для управления ресурсами на сервере."
            },
            "api": {
                "name": "API",
                "description": "Набор определений и протоколов, который используется для взаимодействия между различными компонентами программного обеспечения. API определяет, как различные части программы могут общаться друг с другом."
            },
            "npm": {
                "name": "NPM",
                "description": "Пакетный менеджер для JavaScript, используемый для установки, управления и публикации пакетов кода. npm позволяет разработчикам легко находить и устанавливать зависимости проекта, а также делиться своими собственными пакетами с сообществом."
            },
            "docker": {
                "name": "Docker",
                "description": "Платформа для разработки, доставки и запуска приложений в контейнерах. Контейнеры Docker обеспечивают изолированную среду для приложений и их зависимостей, что делает приложения переносимыми и легко масштабируемыми."
            },
            "jquery": {
                "name": "jQuery",
                "description": "Библиотека JavaScript, облегчающая манипулирование HTML-элементами, обработку событий, анимацию и взаимодействие с сервером. jQuery упрощает написание кросс-браузерного JavaScript кода и ускоряет разработку веб-приложений."
            },
            "node": {
                "name": "Node.js",
                "description": "Среда выполнения JavaScript на стороне сервера, позволяющая создавать высокопроизводительные и масштабируемые сетевые приложения. Node.js основан на движке V8 от Google Chrome и обеспечивает асинхронное и событийно-ориентированное программирование."
            },
            "express": {
                "name": "Express",
                "description": "Минималистичный и гибкий веб-фреймворк для Node.js, который облегчает создание веб-приложений и API. Express предоставляет набор методов и утилит для обработки HTTP-запросов, маршрутизации и управления сессиями."
            },
            "passport": {
                "name": "Passport.js",
                "description": "Библиотека аутентификации для Node.js, которая обеспечивает простой и гибкий механизм аутентификации и авторизации в веб-приложениях. Passport.js поддерживает различные стратегии аутентификации, такие как локальная аутентификация, OAuth и OpenID."
            },
            "mongo": {
                "name": "MongoDB",
                "description": "Документоориентированная NoSQL база данных, используемая для хранения и управления данными в формате документов JSON. MongoDB предлагает гибкую схему данных, масштабируемость и высокую производительность при работе с большими объемами данных."
            },
            "postgresql": {
                "name": "PostgreSQL",
                "description": "Реляционная база данных с открытым исходным кодом, которая поддерживает расширенные возможности SQL и обеспечивает надежное хранение и управление данными. PostgreSQL предлагает множество функций, включая транзакционную поддержку, геоданные и полнотекстовый поиск."
            },
            "firebase": {
                "name": "Firebase",
                "description": "Платформа от Google для разработки приложений, которая предоставляет набор инструментов для создания высококачественных веб- и мобильных приложений. Firebase включает в себя такие сервисы, как база данных в реальном времени, аутентификация, хостинг, облачные функции и многое другое."
            },
            "cloud": {
                "name": "Google Cloud",
                "description": "Облачная платформа, предоставляемая Google, которая предлагает различные облачные услуги, включая вычислительные ресурсы, хранилище данных, базы данных, аналитику, машинное обучение и многое другое."
            },
            "cloudinary": {
                "name": "Cloudinary",
                "description": "Облачный сервис для управления медиа-контентом, таким как изображения, видео и аудио. Cloudinary предоставляет API для загрузки, обработки, хранения и доставки медиа-контента в веб-приложениях."
            },
            "scss": {
                "name": "SCSS / SASS",
                "description": "Препроцессор CSS, который расширяет функциональность обычного CSS, добавляя переменные, вложенные правила, миксины и другие возможности, упрощая и улучшая процесс стилизации."
            },
            "less": {
                "name": "LESS",
                "description": "Ещё один препроцессор CSS, похожий на SCSS/SASS, который добавляет дополнительные функции к стандартному CSS, такие как переменные, миксины, вложенные стили и другие."
            },
            "material": {
                "name": "Material UI",
                "description": "Библиотека компонентов пользовательского интерфейса, основанная на дизайн-системе Material Design от Google. Material UI предоставляет готовые компоненты для разработки современных и стильных веб-приложений с использованием React."
            },
            "framer": {
                "name": "Framer Motion",
                "description": "Библиотека анимаций для React, которая обеспечивает простой и декларативный способ создания анимаций в веб-приложениях. Framer Motion позволяет создавать различные виды анимаций, такие как переходы между компонентами, анимированные компоненты и многое другое."
            },
            "bootstrap": {
                "name": "Bootstrap",
                "description": "Фреймворк для разработки веб-приложений и мобильных приложений, который предоставляет набор готовых компонентов и стилей CSS. Bootstrap помогает создавать адаптивные и стильные интерфейсы с минимальными усилиями."
            },
            "tailwind": {
                "name": "Tailwind CSS",
                "description": "Фреймворк CSS, который предоставляет набор готовых классов для стилизации веб-страниц. Tailwind CSS использует подход \"utility-first\", позволяя быстро и гибко создавать пользовательские стили с помощью классов CSS."
            },
            "styled": {
                "name": "Styled-Components",
                "description": "Библиотека для стилизации компонентов в React приложениях с использованием CSS в виде JavaScript. Styled-Components позволяет создавать компоненты с привязанными стилями, что облегчает создание и поддержку стилизованных компонентов."
            },
            "vscode": {
                "name": "VS Code",
                "description": "Интегрированная среда разработки (IDE) от Microsoft, предназначенная для написания кода. VS Code обладает множеством расширений, поддерживает различные языки программирования и обеспечивает широкие возможности настройки для удобной и эффективной разработки."
            },
            "devtools": {
                "name": "Chrome DevTools",
                "description": "Инструменты разработчика веб-браузеров, такие как Chrome DevTools или Firefox Developer Tools, предоставляющие разработчикам возможность отладки, профилирования и анализа веб-приложений. Dev Tools включают в себя инструменты для инспектирования HTML, CSS, JavaScript, сетевых запросов и многое другое."
            },
            "webpack": {
                "name": "Webpack",
                "description": "Модульный упаковщик для JavaScript приложений, который позволяет объединять и управлять зависимостями проекта. Webpack позволяет создавать статические ассеты, такие как JavaScript, CSS и изображения, а также оптимизировать их для производства."
            },
            "vite": {
                "name": "Vite",
                "description": "Быстрый инструмент для разработки веб-приложений, который использует современные возможности JavaScript, такие как ESM (ECMAScript Modules) и HMR (Hot Module Replacement). Vite позволяет разрабатывать веб-приложения с высокой скоростью и эффективностью."
            },
            "parcel": {
                "name": "Parcel",
                "description": "Инструмент для объединения и оптимизации файлов JavaScript и CSS. Parcel предоставляет простой и декларативный способ создания веб-приложений с использованием JavaScript и CSS."
            },
            "babel": {
                "name": "Babel",
                "description": "Инструмент для транспиляции кода JavaScript из современного стандарта в старый, совместимый с более широким диапазоном браузеров и сред выполнения JavaScript. Babel позволяет использовать новые возможности языка JavaScript, не беспокоясь о совместимости."
            },
            "postman": {
                "name": "Postman",
                "description": "Инструмент для тестирования и отладки API, который обеспечивает удобный интерфейс для отправки HTTP запросов и проверки ответов. Postman позволяет создавать и автоматизировать тесты API, а также делиться коллекциями запросов с другими разработчиками."
            },
            "figma": {
                "name": "Figma",
                "description": "Графический редактор и среда для дизайна интерфейсов, который позволяет дизайнерам создавать макеты, прототипы и коллаборировать над дизайн-проектами в реальном времени. Figma предоставляет широкие возможности для создания современных и интерактивных дизайнов."
            },
            "photoshop": {
                "name": "Adobe Photoshop",
                "description": "Графический редактор, разработанный Adobe, который широко используется для создания и редактирования изображений. Photoshop предоставляет множество инструментов для работы с цифровыми изображениями, включая ретушь, наложение эффектов и создание композиций."
            }
        }
    }
}
